tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "pulumi/tap"
tap "steveyegge/beads"
brew "age"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "biome"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "mise"
brew "multitail"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "oxker"
brew "parquet-cli"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "python-tk@3.14"
brew "rainfrog"
brew "rustup"
brew "sevenzip"
brew "starship"
brew "stow"
brew "tailscale"
brew "tealdeer"
brew "tmux"
brew "unzip"
brew "yazi"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "pulumi/tap/pulumi"
brew "steveyegge/beads/bd"
cask "aerospace"
cask "alacritty"
cask "azure-data-studio"
cask "brave-browser"
cask "claude-code"
cask "codex"
cask "copilot-cli"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nf"
cask "ghostty"
cask "jan"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "libreoffice"
cask "localsend"
cask "lulu"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "postico"
cask "postman"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "raycast"
cask "signal"
cask "syncthing-app"
cask "tor-browser"
cask "visual-studio-code"
cask "windows-app"
cask "wireshark-app"
cask "zed"
