tap "auto-explore/gitcomet"
tap "azure/functions"
tap "christo-auer/eilmeldung", "https://github.com/christo-auer/eilmeldung"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "gurgeous/tap"
tap "hashicorp/tap"
tap "jstkdng/programs"
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "nikitabobko/tap"
tap "protonpass/tap"
tap "pulumi/tap"
tap "steveyegge/beads"
brew "age"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "biome"
brew "bmon"
brew "btop"
brew "chafa"
brew "cmake"
brew "cmake-docs"
brew "container"
brew "coreutils"
brew "duckdb"
brew "fd"
brew "ffmpeg-full", link: true
brew "forgejo-cli"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "go"
brew "htop"
brew "imagemagick"
brew "imagemagick-full"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lua-language-server"
brew "make"
brew "mise"
brew "multitail"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "oxker"
brew "parquet-cli"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "pre-commit"
brew "python-tk@3.14"
brew "rainfrog"
brew "resterm"
brew "resvg"
brew "rustup"
brew "sevenzip"
brew "shellcheck"
brew "signal-cli"
brew "sqlc"
brew "starship"
brew "stow"
brew "stylua"
brew "tealdeer"
brew "terraform-ls"
brew "tmux"
brew "tree-sitter-cli"
brew "unzip"
brew "viu"
brew "yazi"
brew "zoxide"
brew "azure/functions/azure-functions-core-tools@4"
brew "felixkratz/formulae/borders"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "jstkdng/programs/ueberzugpp"
brew "pulumi/tap/pulumi"
brew "steveyegge/beads/bd"
cask "nikitabobko/tap/aerospace"
cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "codex"
cask "copilot-cli"
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf"
cask "font-monaspace-nf"
cask "font-symbols-only-nerd-font"
cask "geekbench"
cask "ghostty"
cask "auto-explore/gitcomet/gitcomet"
cask "google-chrome"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "lm-studio"
cask "lulu"
cask "miro"
cask "obsidian"
cask "onyx"
cask "orbstack"
cask "postico"
cask "proton-pass"
cask "raycast"
cask "signal"
cask "spotify"
cask "syncthing-app"
cask "tailscale-app"
cask "visual-studio-code"
cask "windows-app"
cask "zed"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "cmd/go"
go "cmd/gofmt"
