tap "auto-explore/gitcomet"
tap "azure/functions"
tap "christo-auer/eilmeldung", "https://github.com/christo-auer/eilmeldung"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "gurgeous/tap"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "protonpass/tap"
tap "pulumi/tap"
tap "steveyegge/beads"
brew "age"
brew "python@3.14"
brew "tree"
brew "ansible"
brew "automake"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "biome"
brew "btop"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "glow"
brew "go"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "mise"
brew "mistral-vibe"
brew "multitail"
brew "neovim"
brew "ripgrep"
brew "opencode"
brew "oxker"
brew "parquet-cli"
brew "pipx"
brew "pngpaste"
brew "pnpm"
brew "poppler"
brew "pre-commit"
brew "python-tk@3.14"
brew "rainfrog"
brew "resterm"
brew "rustup"
brew "sevenzip"
brew "shellcheck"
brew "starship"
brew "stow"
brew "tailscale"
brew "tealdeer"
brew "tmux"
brew "unzip"
brew "yazi"
brew "zoxide"
brew "azure/functions/azure-functions-core-tools@4"
brew "felixkratz/formulae/borders"
brew "go-task/tap/go-task"
brew "hashicorp/tap/terraform"
brew "protonpass/tap/pass-cli"
brew "pulumi/tap/pulumi"
brew "steveyegge/beads/bd"
cask "nikitabobko/tap/aerospace"
cask "brave-browser"
cask "bruno"
cask "codex"
cask "copilot-cli"
cask "docker-desktop"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace-nf"
cask "ghostty"
cask "auto-explore/gitcomet/gitcomet"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "libreoffice"
cask "lulu"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "obsidian"
cask "onyx"
cask "postico"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "raycast"
cask "signal"
cask "spotify"
cask "syncthing-app"
cask "visual-studio-code"
cask "windows-app"
cask "zed"
vscode "anthropic.claude-code"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "github.copilot-chat"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "pmndrs.pmndrs"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
go "github.com/air-verse/air"
go "cmd/go"
go "cmd/gofmt"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
